devdnl/dnx-rtos/src/system/drivers/clk/stm32f7/clk.c
           && (RCC->BDCR & RCC_BDCR_RTCEN) == 0
           && (RCC->BDCR & (RCC_BDCR_RTCSEL_1 | RCC_BDCR_RTCSEL_0)) == 0) {

                SET_BIT(RCC->APB1ENR, RCC_APB1ENR_PWREN);
                SET_BIT(PWR->CR1, PWR_CR1_DBP);
                LL_RCC_SetRTCClockSource(__CLK_RTC_SRC__);
        }

        //----------------------------------------------------------------------
        // Main PLL configuration
        //----------------------------------------------------------------------
        if (__CLK_PLL_ON__) {

                LL_RCC_PLL_ConfigDomain_SYS(__CLK_PLL_SRC__, __CLK_PLL_SRC_DIV_M__,
                                            __CLK_PLL_N__, __CLK_PLL_P__);

                LL_RCC_PLL_ConfigDomain_48M(__CLK_PLL_SRC__, __CLK_PLL_SRC_DIV_M__,
                                            __CLK_PLL_N__, __CLK_PLL_Q__);

                LL_RCC_PLL_Enable();

                u64_t tref = sys_time_get_reference();
                while (not sys_time_is_expired(tref, TIMEOUT_MS)) {
                        if (LL_RCC_PLL_IsReady()) {
                                break;
                        }
                }

                if (sys_time_is_expired(tref, TIMEOUT_MS)) {
                        printk("CLK: PLL timeout");
                }
        }

        //----------------------------------------------------------------------
        // I2S PLL configuration
        //----------------------------------------------------------------------
        if (__CLK_PLLI2S_ON__) {

                LL_RCC_PLLI2S_ConfigDomain_I2S(__CLK_PLL_SRC__, __CLK_PLL_SRC_DIV_M__,
                                               __CLK_PLLI2S_N__, __CLK_PLLI2S_R__);

                LL_RCC_PLLI2S_ConfigDomain_SAI(__CLK_PLL_SRC__, __CLK_PLL_SRC_DIV_M__,
                                               __CLK_PLLI2S_N__, __CLK_PLLI2S_Q__,
                                               __CLK_PLLI2S_Q_DIV__);

                LL_RCC_PLLI2S_ConfigDomain_SPDIFRX(__CLK_PLL_SRC__, __CLK_PLL_SRC_DIV_M__,
                                                   __CLK_PLLI2S_N__, __CLK_PLLI2S_P__);

                LL_RCC_PLLI2S_Enable();

                u64_t tref = sys_time_get_reference();
                while (not sys_time_is_expired(tref, TIMEOUT_MS)) {
                        if (LL_RCC_PLLI2S_IsReady()) {
                                break;
                        }
                }

                if (sys_time_is_expired(tref, TIMEOUT_MS)) {
                        printk("CLK: PLLI2S timeout");
                }
        }

        //----------------------------------------------------------------------
        // SAI PLL configuration
        //----------------------------------------------------------------------
        if (__CLK_PLLSAI_ON__) {

                LL_RCC_PLLSAI_ConfigDomain_48M(__CLK_PLL_SRC__, __CLK_PLL_SRC_DIV_M__,
                                               __CLK_PLLSAI_N__, __CLK_PLLSAI_P__);
                LL_RCC_PLLSAI_ConfigDomain_LTDC(__CLK_PLL_SRC__, __CLK_PLL_SRC_DIV_M__,
                                                __CLK_PLLSAI_N__, __CLK_PLLSAI_R__,
                                                __CLK_PLLSAI_R_DIV__);
                LL_RCC_PLLSAI_ConfigDomain_SAI(__CLK_PLL_SRC__, __CLK_PLL_SRC_DIV_M__,
                                               __CLK_PLLSAI_N__, __CLK_PLLSAI_Q__,
                                               __CLK_PLLSAI_Q_DIV__);

                LL_RCC_PLLSAI_Enable();

                u64_t tref = sys_time_get_reference();
                while (not sys_time_is_expired(tref, TIMEOUT_MS)) {
                        if (LL_RCC_PLLSAI_IsReady()) {
                                break;
                        }
                }

                if (sys_time_is_expired(tref, TIMEOUT_MS)) {
                        printk("CLK: PLLSAI timeout");
                }
        }

        //----------------------------------------------------------------------
        // Peripheral clock sources and prescalers
        //----------------------------------------------------------------------
        LL_RCC_SetAHBPrescaler(__CLK_AHB_PRE__);
        LL_RCC_SetAPB1Prescaler(__CLK_APB1_PRE__);
        LL_RCC_SetAPB2Prescaler(__CLK_APB2_PRE__);
        LL_RCC_SetSysClkSource(__CLK_SYS_CLK_SRC__);

        //----------------------------------------------------------------------
        // LPTimer clock source
        //----------------------------------------------------------------------
        LL_RCC_SetLPTIMClockSource(__CLK_LPTIM1_SRC__);

        //----------------------------------------------------------------------
        // USART/UART clock source
        //----------------------------------------------------------------------
        LL_RCC_SetUSARTClockSource(__CLK_USART1_SRC__);
        LL_RCC_SetUSARTClockSource(__CLK_USART2_SRC__);
        LL_RCC_SetUSARTClockSource(__CLK_USART3_SRC__);
        LL_RCC_SetUARTClockSource(__CLK_UART4_SRC__);
        LL_RCC_SetUARTClockSource(__CLK_UART5_SRC__);
        LL_RCC_SetUSARTClockSource(__CLK_USART6_SRC__);
        LL_RCC_SetUARTClockSource(__CLK_UART7_SRC__);
        LL_RCC_SetUARTClockSource(__CLK_UART8_SRC__);

        //----------------------------------------------------------------------
        // I2C clock source
        //----------------------------------------------------------------------
        LL_RCC_SetI2CClockSource(__CLK_I2C1_SRC__);
        LL_RCC_SetI2CClockSource(__CLK_I2C2_SRC__);
        LL_RCC_SetI2CClockSource(__CLK_I2C3_SRC__);

        #if defined(I2C4)
        LL_RCC_SetI2CClockSource(__CLK_I2C4_SRC__);
        #endif

        //----------------------------------------------------------------------
        // SDMMC clock source
        //----------------------------------------------------------------------
        #if defined(SDMMC1)
        LL_RCC_SetSDMMCClockSource(__CLK_SDMMC1_SRC__);
        #endif

        #if defined(SDMMC2)
        LL_RCC_SetSDMMCClockSource(__CLK_SDMMC2_SRC__);
        #endif

        //----------------------------------------------------------------------
        // HDMI-CEC clock source
        //----------------------------------------------------------------------
        LL_RCC_SetCECClockSource(__CLK_CEC_SRC__);

        //----------------------------------------------------------------------
        // DFSDM clock source
        //----------------------------------------------------------------------
        #if defined(DFSDM1_Channel0)
        LL_RCC_SetDFSDMAudioClockSource(__CLK_DFSDM1_AUDIO_SRC__);
        LL_RCC_SetDFSDMClockSource(__CLK_DFSDM1_SRC__);
        #endif

        //----------------------------------------------------------------------
        // DSI clock source
        //----------------------------------------------------------------------
        #if defined(DSI)
        LL_RCC_SetDSIClockSource(__CLK_DSI_SRC__)
        #endif

        //----------------------------------------------------------------------
        // USB & RND clock source
        //----------------------------------------------------------------------
        LL_RCC_SetUSBClockSource(__CLK_USB_SRC__);

        //----------------------------------------------------------------------
        // I2S clock source
        //----------------------------------------------------------------------
        LL_RCC_SetI2SClockSource(__CLK_I2S1_SRC__);

        //----------------------------------------------------------------------
        // SAI1 clock source
        //----------------------------------------------------------------------
        LL_RCC_SetSAIClockSource(__CLK_SAI1_SRC__);
        LL_RCC_SetSAIClockSource(__CLK_SAI2_SRC__);

