devdnl/dnx-rtos/src/system/drivers/clk/stm32f7/clk.c
                        case 12:
                                clkinf->freq_Hz = LL_RCC_GetUARTClockFreq(LL_RCC_UART5_CLKSOURCE);
                                clkinf->name = "UART5";
                                break;

                        case 13:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART6_CLKSOURCE);
                                clkinf->name = "USART6";
                                break;

                        case 14:
                                clkinf->freq_Hz = LL_RCC_GetUARTClockFreq(LL_RCC_UART7_CLKSOURCE);
                                clkinf->name = "UART7";
                                break;

                        case 15:
                                clkinf->freq_Hz = LL_RCC_GetUARTClockFreq(LL_RCC_UART8_CLKSOURCE);
                                clkinf->name = "UART8";
                                break;

                        case 16:
                                clkinf->freq_Hz = LL_RCC_GetI2CClockFreq(LL_RCC_I2C1_CLKSOURCE);
                                clkinf->name = "I2C1";
                                break;

                        case 17:
                                clkinf->freq_Hz = LL_RCC_GetI2CClockFreq(LL_RCC_I2C2_CLKSOURCE);
                                clkinf->name = "I2C2";
                                break;

                        case 18:
                                clkinf->freq_Hz = LL_RCC_GetI2CClockFreq(LL_RCC_I2C3_CLKSOURCE);
                                clkinf->name = "I2C3";
                                break;

                        case 19:
                                clkinf->freq_Hz = LL_RCC_GetI2CClockFreq(LL_RCC_I2C4_CLKSOURCE);
                                clkinf->name = "I2C4";
                                break;

                        case 20:
                                clkinf->freq_Hz = LL_RCC_GetSDMMCClockFreq(LL_RCC_SDMMC1_CLKSOURCE);
                                clkinf->name = "SDMMC1";
                                break;

                        case 21:
                                #if defined(SDMMC2)
                                clkinf->freq_Hz = LL_RCC_GetSDMMCClockFreq(LL_RCC_SDMMC2_CLKSOURCE);
                                #else
                                clkinf->freq_Hz = 0;
                                #endif
                                clkinf->name = "SDMMC2";
                                break;

                        case 22:
                                clkinf->freq_Hz = LL_RCC_GetCECClockFreq(LL_RCC_CEC_CLKSOURCE);
                                clkinf->name = "CEC";
                                break;

                        case 23:
                                #if defined(DFSDM1_Channel0)
                                clkinf->freq_Hz = LL_RCC_GetDFSDMAudioClockFreq(LL_RCC_DFSDM1_AUDIO_CLKSOURCE);
                                #else
                                clkinf->freq_Hz = 0;
                                #endif
                                clkinf->name = "DFSDM Audio";
                                break;

                        case 24:
                                #if defined(DFSDM1_Channel0)
                                clkinf->freq_Hz = LL_RCC_GetDFSDMClockFreq(LL_RCC_DFSDM1_CLKSOURCE);
                                #else
                                clkinf->freq_Hz = 0;
                                #endif
                                clkinf->name = "DFSDM";
                                break;

                        case 25:
                                #if defined(DSI)
                                clkinf->freq_Hz = LL_RCC_GetDSIClockFreq(LL_RCC_DSI_CLKSOURCE);
                                #else
                                clkinf->freq_Hz = 0;
                                #endif
                                clkinf->name = "DSI";
                                break;

                        case 26:
                                clkinf->freq_Hz = LL_RCC_GetUSBClockFreq(LL_RCC_USB_CLKSOURCE);
                                clkinf->name = "USB/RNG";
                                break;

                        case 27:
                                #if defined(SPDIFRX)
                                clkinf->freq_Hz = LL_RCC_GetSPDIFRXClockFreq(LL_RCC_SPDIFRX1_CLKSOURCE);
                                #else
                                clkinf->freq_Hz = 0;
                                #endif
                                clkinf->name = "SPDIF";
                                break;

                        case 28:
                                clkinf->freq_Hz = LL_RCC_GetI2SClockFreq(LL_RCC_I2S1_CLKSOURCE);
                                clkinf->name = "I2S";
                                break;

                        case 29:
                                clkinf->freq_Hz = LL_RCC_GetSAIClockFreq(LL_RCC_SAI1_CLKSOURCE);
                                clkinf->name = "SAI1";
                                break;

                        case 30:
                                clkinf->freq_Hz = LL_RCC_GetSAIClockFreq(LL_RCC_SAI2_CLKSOURCE);
                                clkinf->name = "SAI2";
                                break;

                        default:
                                clkinf->freq_Hz = 0;
                                clkinf->name = NULL;
                                break;
                        }

                        clkinf->iterator++;

                        err = ESUCC;
                } else {
                        err = EBADRQC;
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_FLUSH(CLK, void *device_handle)
{
        UNUSED_ARG1(device_handle);
        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_STAT(CLK, void *device_handle, struct vfs_dev_stat *device_stat)
{
        UNUSED_ARG2(device_handle, device_stat);
        return ESUCC;
}

//==============================================================================
/**
 * @brief Function set flash latency (wait states)
 *
 * @return One of errno value.
 */
//==============================================================================
static int configure_core_voltage_and_flash_latency(void)
{
        int err = 0;

        SET_BIT(RCC->APB1ENR, RCC_APB1ENR_PWREN);

        u32_t hclk = __CLK_HCLK_FREQ__ / 1000000;

