devdnl/dnx-rtos/src/system/drivers/clk/stm32f7/clk.c
        u32_t VOS;
        if (hclk <= 144) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE3;

        } else if (hclk <= 168) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE2;

        } else if (hclk <= 180) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE1;

        } else {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE0;
        }

        // Set the core voltage
        if ((PWR->CR1 & PWR_CR1_VOS) != VOS) {
                u32_t VOS_tmp = (VOS == PWR_REGULATOR_VOLTAGE_SCALE0) ? PWR_REGULATOR_VOLTAGE_SCALE1 : VOS;
                MODIFY_REG(PWR->CR1, PWR_CR1_VOS_Msk, VOS_tmp);

                // Enable core boost voltage
                #if defined(PWR_CR1_ODEN)
                if (!err && (VOS == PWR_REGULATOR_VOLTAGE_SCALE0)) {
                        SET_BIT(PWR->CR1, PWR_CR1_ODEN);
                        u64_t tref = sys_time_get_reference();
                        while (not (PWR->CSR1 & PWR_CSR1_ODRDY)) {
                                if (sys_time_is_expired(tref, TIMEOUT_MS)) {
                                        printk("CLK: VOS0 timeout");
                                        err = ETIME;
                                        break;
                                }

                                sys_sleep_ms(1);
                        }
                }
                #endif
        }

        if (!err) {
                u64_t tref = sys_time_get_reference();
                while (not sys_time_is_expired(tref, TIMEOUT_MS)) {
                        MODIFY_REG(FLASH->ACR, FLASH_ACR_LATENCY_Msk, __CLK_FLASH_LATENCY__);
                        if ((FLASH->ACR & FLASH_ACR_LATENCY_Msk) == __CLK_FLASH_LATENCY__) {
                                break;
                        }
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief Function enable prefetch buffer
 */
//==============================================================================
static void enable_prefetch_buffer(void)
{
        SET_BIT(FLASH->ACR, FLASH_ACR_PRFTEN | FLASH_ACR_ARTEN);
}

//==============================================================================
/**
 * @brief Function return APB1 divider
 *
 * @return true if APB1 is divided, false if not
 */
//==============================================================================
static bool is_APB1_divided(void)
{
        return (RCC->CFGR & RCC_CFGR_PPRE1_2);
}

//==============================================================================
/**
 * @brief Function return APB2 divider
 *
 * @return true if APB2 is divided, false if not
 */
//==============================================================================
static bool is_APB2_divided(void)
{
        return (RCC->CFGR & RCC_CFGR_PPRE2_2);
}

/*==============================================================================
  End of file
==============================================================================*/
